# ReverseIterator Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
EdgeArrayArray..::..ReverseIterator Method
EdgeArrayArray Class See Also
---
Retrieve a backward moving iterator to the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual EdgeArrayArrayIterator ReverseIterator()
```

Visual Basic
---
```text
Public Overridable Function ReverseIterator As EdgeArrayArrayIterator
```

Visual C++
---
```text
public:
virtual EdgeArrayArrayIterator^ ReverseIterator()
```

# ### Return Value
Returns a backward moving iterator to the array.
# See Also
EdgeArrayArray Class
Autodesk.Revit.DB Namespace